mas41672/20230106CubeIDEHelloBluetooth/HelloBleProject/HelloBleProject.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.solution=PA0-WKUP
ProjectManager.MainLocation=Core/Src
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.i2creg=
PA6.Mode=Full_Duplex_Master
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.name=Reset Line
USART2.IPParameters=VirtualMode
RCC.CortexFreq_Value=64000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F411RETx
SPI1.VirtualType=VM_MASTER
RCC.PLLCLKFreq_Value=64000000
RCC.PLLQCLKFreq_Value=32000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_USART2_UART_Init-USART2-false-HAL-true
RCC.RTCFreq_Value=32000
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.ip=GPIO
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.api=Unknown
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.ip=GPIO
PinOutPanel.RotationAngle=0
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.condition=SEMBlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACEJjUserBoard
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.solution=SPI1
SH.GPXTI13.0=GPIO_EXTI13
STMicroelectronics.X-CUBE-BLE2.3.2.0.BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACE=UserBoard
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.semaphore=
Mcu.IP4=USART2
RCC.FCLKCortexFreq_Value=64000000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=SPI1
Mcu.IP3=SYS
Mcu.IP0=NVIC
Mcu.IP1=RCC
Mcu.UserConstants=
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.STBoard=false
PH0\ -\ OSC_IN.Signal=RCC_OSC_IN
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.STBoard=false
SH.GPXTI13.ConfNb=1
Mcu.ThirdPartyNb=1
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=64000000
Mcu.IPNb=5
RCC.I2SClocksFreq_Value=96000000
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.instance=PA8
ProjectManager.PreviousToolchain=STM32CubeIDE
RCC.APB2TimFreq_Value=64000000
RCC.VcooutputI2S=96000000
SPI1.CalculateBaudRate=1000.0 KBits/s
Mcu.Pin6=PA1
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.i2creg=
Mcu.Pin7=PA2
Mcu.Pin8=PA3
Mcu.Pin9=PA5
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.STBoard=false
RCC.AHBFreq_Value=64000000
Mcu.Pin0=PC13-ANTI_TAMP
Mcu.Pin1=PC14-OSC32_IN
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.STBoard=false
GPIO.groupedBy=
Mcu.Pin2=PC15-OSC32_OUT
Mcu.Pin3=PH0 - OSC_IN
STMicroelectronics.X-CUBE-BLE2.3.2.0.IPParameters=BlueNRGAa2CcWirelessJjBlueNRGAa2JjController,BlueNRGAa2CcWirelessJjBlueNRGAa2JjUtils,BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTL,BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACE
NVIC.EXTI15_10_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Mcu.Pin4=PH1 - OSC_OUT
Mcu.Pin5=PA0-WKUP
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.mode=Output
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=Full_Duplex_Master
PA8.Locked=true
PC13-ANTI_TAMP.Signal=GPXTI13
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.26.2
MxDb.Version=DB.6.0.21
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-BLE2.3.2.0
ProjectManager.BackupPrevious=false
PC14-OSC32_IN.Mode=LSE-External-Oscillator
RCC.VCOInputFreq_Value=2000000
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.component=
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.instance=PA1
PA14.Mode=Serial_Wire
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.mode=EXTI
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.condition=SEMBlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACEJjUserBoard
File.Version=6
PA8.Signal=GPIO_Output
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=HelloBleProject
RCC.MCO2PinFreq_Value=64000000
Mcu.Package=LQFP64
PA6.Signal=SPI1_MISO
PA5.Locked=true
PA7.Locked=true
STMicroelectronics.X-CUBE-BLE2.3.2.0.BSP.number=4
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.condition=SEMBlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.component=
USART2.VirtualMode=VM_ASYNC
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
SH.GPXTI0.0=GPIO_EXTI0
PA5.GPIOParameters=GPIO_Label
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.condition=SEMBlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACEJjUserBoard
RCC.APB1TimFreq_Value=64000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.component=
STMicroelectronics.X-CUBE-BLE2.3.2.0_SwParameter=BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACE\:UserBoard;BlueNRGAa2CcWirelessJjBlueNRGAa2JjUtils\:true;BlueNRGAa2CcWirelessJjBlueNRGAa2JjController\:true;BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTL\:Basic;
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_64
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.ip=SPI
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.api=BSP_BUS_DRIVER
ProjectManager.CustomerFirmwarePackage=
PB3.Locked=true
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.name=BUS IO driver
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.component=
PA3.Signal=USART2_RX
PC13-ANTI_TAMP.GPIOParameters=GPIO_Label
PA2.Locked=true
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.i2creg=
ProjectManager.ProjectFileName=HelloBleProject.ioc
PA7.Mode=Full_Duplex_Master
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.instance=PA0-WKUP
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.mode=Output
Mcu.PinsNb=18
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,CLKPhase
PC13-ANTI_TAMP.GPIO_Label=B1
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.semaphore=
PH1\ -\ OSC_OUT.Mode=HSE-External-Clock-Source
SH.GPXTI0.ConfNb=1
ProjectManager.DefaultFWLocation=true
SPI1.CLKPhase=SPI_PHASE_2EDGE
ProjectManager.DeletePrevious=true
VP_STMicroelectronics.X-CUBE-BLE2_VS_WirelessJjBlueNRGAa2_3.2.0.Signal=STMicroelectronics.X-CUBE-BLE2_VS_WirelessJjBlueNRGAa2_3.2.0
RCC.APB1CLKDivider=RCC_HCLK_DIV2
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.FamilyName=M
PA0-WKUP.Signal=GPXTI0
PA0-WKUP.Locked=true
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.solution=PA8
PA3.Mode=Asynchronous
PA13.Signal=SYS_JTMS-SWDIO
VP_STMicroelectronics.X-CUBE-BLE2_VS_WirelessJjBlueNRGAa2_3.2.0.Mode=WirelessJjBlueNRGAa2
PH0\ -\ OSC_IN.Mode=HSE-External-Clock-Source
ProjectManager.TargetToolchain=STM32CubeIDE
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.instance=SPI1
STMicroelectronics.X-CUBE-BLE2.3.2.0.BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTL=Basic
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.name=CS Line
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.i2caddr=0
RCC.VCOInputMFreq_Value=1000000
ProjectManager.RegisterCallBack=
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.ip=GPIO
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PA1.Signal=GPIO_Output
RCC.VCOI2SOutputFreq_Value=192000000
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.i2caddr=0
PA5.Signal=GPIO_Output
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE2.3.2.03.BSP.api=Unknown
PH1\ -\ OSC_OUT.Signal=RCC_OSC_OUT
board=custom
RCC.VCOOutputFreq_Value=128000000
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.solution=PA1
PC13-ANTI_TAMP.Locked=true
ProjectManager.LastFirmware=true
STMicroelectronics.X-CUBE-BLE2.3.2.0.WirelessJjBlueNRGAa2_Checked=true
RCC.APB2Freq_Value=64000000
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.name=Exti Line
MxCube.Version=6.2.1
SPI1.Mode=SPI_MODE_MASTER
VP_SYS_VS_Systick.Mode=SysTick
RCC.EthernetFreq_Value=64000000
STMicroelectronics.X-CUBE-BLE2.3.2.0.BlueNRGAa2CcWirelessJjBlueNRGAa2JjController=true
STMicroelectronics.X-CUBE-BLE2.3.2.0.BlueNRGAa2CcWirelessJjBlueNRGAa2JjUtils=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
STMicroelectronics.X-CUBE-BLE2.3.2.02.BSP.semaphore=
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOInputMFreq_Value,VCOOutputFreq_Value,VcooutputI2S
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F411R(C-E)Tx
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.api=HAL_EXTI_DRIVER
RCC.RTCHSEDivFreq_Value=4000000
PA2.Signal=USART2_TX
ProjectManager.UnderRoot=true
ProjectManager.CoupleFile=false
RCC.48MHZClocksFreq_Value=32000000
PB3.Signal=SPI1_SCK
NVIC.EXTI0_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.SYSCLKFreq_VALUE=64000000
PA1.Locked=true
PA3.Locked=true
PA5.GPIO_Label=LD2
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB3
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=VP_SYS_VS_Systick
Mcu.Pin13=PA13
Mcu.Pin14=PA14
ProjectManager.ComputerToolchain=false
Mcu.Pin17=VP_STMicroelectronics.X-CUBE-BLE2_VS_WirelessJjBlueNRGAa2_3.2.0
RCC.HSI_VALUE=16000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA7
Mcu.Pin12=PA8
RCC.PLLM=8
RCC.PLLN=64
Mcu.Pin10=PA6
PA2.Mode=Asynchronous
STMicroelectronics.X-CUBE-BLE2.3.2.01.BSP.mode=Full-Duplex Master
RCC.APB1Freq_Value=32000000
ProjectManager.DeviceId=STM32F411RETx
ProjectManager.LibraryCopy=1
STMicroelectronics.X-CUBE-BLE2.3.2.00.BSP.semaphore=
PA7.Signal=SPI1_MOSI
PA6.Locked=true
isbadioc=false
